# Зробіть словник де буде табличка множення додавання ділення і віднімання чисел від 2 до 9(включно).
# (так як робили на уроці). Ці значення запишіть в словник з відповідними ключами "+", "-", "/", "*"
#
# Коли ви підготуєте це, запитайте в користувача яку табличку він хоче (побачити
# (додавання, віднімання, множення, ділення)). і виведіть йому цю табличку.
#
#
# 1 Открити пустой словник
# 2 сделать табличку "+", "-", "/", "*" от 2 до 9
# 3 Эти значения записать в словник с ключами "+", "-", "/", "*" ( БУДЕТ дикт)
# 4 спросить у користувача яку табличку он хочет?
# 5 создать условие на (додавання, віднімання, множення, ділення)
# 6 вывести ему выбраную табличку
#
math_dict = {"+": {}, "*": {}, "-": {}, "/": {}}

for i in range(2, 10):
    for j in range(2, 10):
        math_dict["+"][i, j] = f"{i}+{j}={i + j}"
        math_dict["*"][i, j] = f"{i}*{j}={i * j}"
        math_dict["-"][i, j] = f"{i}-{j}={i - j}"
        math_dict["/"][i, j] = f"{i}/{j}={round((i / j), 2)}"

user_choice = input("Яку таблицю ви хочете бачити? Введіть: '+','-','*' або '/':")

if user_choice == "+":
    for i in math_dict["+"]:
        print(math_dict["+"][i])
elif user_choice == "*":
    for i in math_dict["*"]:
        print(math_dict["*"][i])
elif user_choice == "-":
    for i in math_dict["-"]:
        print(math_dict["-"][i])
elif user_choice == "/":
    for i in math_dict["/"]:
        print(math_dict["/"][i])
else:
    print("Такої операції немає")
