# # # Візьміть дві задачі з попередніх уроків, перша легка по вирішенню(декілька стрічок),
# # # друга більш складна і перепишіть їх на функції. Памятайте про Атамарність та god object.
# # # Там де написано що користувач має щось ввести то перероблюємо на функція приймає.
# # # Подивіться може можна за допомогою функції спростити код. В домашку вставте будь ласка опис задачі
# # # (далі(один з наступних уроків) буде домашка вашу домашку покрити тестами, але ми трохи поміняємо варіанти).
# #
# # # 14 Податки
# # # Прийшов час податків і вам треба написати програму що б допомогти відділу бугалтерії
# # # програма приймає від користувача його зарплату за 3 місяці та відсоток який він має сплатити.
# # # Виведіть на екран скільки треба податків сплатити. Не забудьте ЄСВ(4422)
# #
# # def calculate_tax(salary, single_tax):
# #     tax_to_pay = (salary * (single_tax / 100)) + 4422
# #     return tax_to_pay
# #
# # user_salary = float(input("Введіть зарплату:"))
# # user_single_tax = float(input("Введіть процент податку:"))
# #
# # result = calculate_tax(salary=user_salary, single_tax=user_single_tax)
# # print(result)
#
# _______________________________________________________________________________________________________________
#
# # Задача 2
# #
# # Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
# #
# # що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
# # що б видалити по індексу треба його передати в pop list_a.pop(0) -
# # видалить нульовий індекс, памятайте що користувач не знає що в нас індекси починаються з нуля)
# #
# # Також нам відомо що цей список має пять або більше елементів.
# #
# # Після кожного видалення елементу виводьте наш оновлений список.
# #
# # Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти,
# # якщо пусти то напишіть про це.
# #
# # Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик.
# # і виведіть їх на екран.
# # Але цього разу вже без видалень.
#
# def add_product():
#     list = input("Введіть список продуктів через пробіл").split()
#     print(f"Ось ваш список продуктів: {list}")
#     return list
#
#
# def delete_product(list):
#     index = int(input("Який продукт ви вже купили?"))
#     if 0 < index <= len(list):
#         list.pop(index - 1)
#         print(f"Ось ваш оновлений список продуктів: {list}")
#         return list
#
#
# user_list = add_product()
#
# while len(user_list) > 0:
#     delete_product(list=user_list)
#
# if len(user_list) == 0:
#     user_list = add_product()
# else:
#     if len(user_list) > 0:
#         print(f"Ви ще не все купили. Ось що вам залишилось: {user_list}")
#         delete_product(list=user_list)
