# Візьміть дві задачі з попередніх уроків, перша легка по вирішенню(декілька стрічок),
# друга більш складна і перепишіть їх на функції. Памятайте про Атамарність та god object.
# Там де написано що користувач має щось ввести то перероблюємо на функція приймає.
# Подивіться може можна за допомогою функції спростити код. В домашку вставте будь ласка опис задачі
# (далі(один з наступних уроків) буде домашка вашу домашку покрити тестами, але ми трохи поміняємо варіанти).

# 14 Податки
# Прийшов час податків і вам треба написати програму що б допомогти відділу бугалтерії
# програма приймає від користувача його зарплату за 3 місяці та відсоток який він має сплатити.
# Виведіть на екран скільки треба податків сплатити. Не забудьте ЄСВ(4422)

def calculate_tax(salary, single_tax):
    tax_to_pay = (salary * (single_tax / 100)) + 4422
    return tax_to_pay

user_salary = float(input("Введіть зарплату:"))
user_single_tax = float(input("Введіть процент податку:"))

result = calculate_tax(salary=user_salary, single_tax=user_single_tax)
print(result)

