# Homework
# 1 Арифметичні операції:
# Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.

# var_1 = 20
# var_2 = 10

# сума
# result = var_1 + var_2
# print(result)

# різниця
# result = var_1 - var_2
# print(result)

# добуток
# result = var_1 * var_2
# print(result)

# частка
# result = var_1 / var_2
# print(result)

# _____________________________________________________________________________________________________________________

# 2 Залишок від ділення:
# Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.

# result = var_1 % var_2
# print(result)

# _____________________________________________________________________________________________________________________

# 3 Цілочисельне ділення:
# Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.

#result = var_1 // var_2
#print(result)

# _____________________________________________________________________________________________________________________

# 4 Перетворення стрічки у число:
# Користувач вводить рядок, який складається з цифр. Програма повинна перетворити його на число та вивести.

# var_string = int(input("введіть число"))
# print(type(var_string))

# _____________________________________________________________________________________________________________________

# 5 Стрічкова конкатенація + математика:
# Користувач вводить два числа. Програма повинна вивести два прінти: перший — їхню суму, другий об'єднати їх.
# Якщо в нас числа 5 та 4, то результат повинен бути 9 та 54.

# num_one = input("Введіть число 1:")
# num_two = input("Введіть число 2:")

# concat = num_one + num_two
# sum = int(num_one) + int(num_two)

# print(concat)
# print(sum)

# _______________________________________________________________________________________________________________

# 6 Вік користувача:
# # Запитати у користувача його рік народження, ім'я та який зараз рік (три змінні)
# # та вивести на екран два прінти: ім'я та скільки років користувачу.

# age = int(input("Ваш рік народження?"))
# name = input("Ваше ім'я?")
# age_now = int(input("Який зараз рік?"))
# age_users = age_now - age
# print("Ваше ім'я:",name)
# print("Ваш вік:",age_users)

# _______________________________________________________________________________________________________________

# 7 Перевод з цельсія в фаренгейт:
# Напишіть програму, яка запитує в користувача кількість градусів в цельсіях і повертає в фаренгейтах.

# degrees_in_c = float(input("Скільки градусів в цельсіях?"))
# degrees_in_f = (degrees_in_c * 9/5) + 32
# print(degrees_in_f)

# _______________________________________________________________________________________________________________

# 8 Перевод з фаренгейта в цельсій:
# Напишіть програму, яка запитує в користувача кількість градусів в фаренгейтах і повертає в цельсіях.
# Вам може здатися, що ця задача така ж, як попередня, але будьте уважні і перевірте результат вручну.

# degrees_in_f = float(input("Скільки градусів в фаренгейту?"))
# degrees_in_c = (degrees_in_f - 32) * 5/9
# print(degrees_in_c)

# _______________________________________________________________________________________________________________

# 9 Теорема Піфагора:
# Запитайте у користувача довжини катетів та виведіть на екран довжину гіпотенузи.
# Трикутник рівнобедрений. Що б взвести в степінь ставимо два рази множення
# два в степені три буде так 2**3, квадратний корінь з двух буде 2**(1/2)

# a = float(input("Яка довжіна катетів?"))
# c = a * (2**(1/2))
# print(c)


# _______________________________________________________________________________________________________________


# 10 Школярі та яблука
# n школярів ділять k яблук порівну, недільний залишок залишається в кошику.
# Скільки яблук дістанеться кожному школярові та скільки залишиться в кошику?
# Програма отримує на вхід числа n і k - цілі, додатні, не перевищують 10000.


# n_students = 41
# k_apples = 1150
# apples_per_student = k_apples // n_students
# remaining_apples = k_apples % n_students
# print(apples_per_student)
# print(remaining_apples)

# _______________________________________________________________________________________________________________

# # 11 Магазин канцелярських товарів
# # Одного разу, відвідавши магазин канцелярських товарів, Вася купив X олівців, Y ручок та Z фломастерів. Відомо,
# # що ціна ручки на 2 гривні більше ціни олівця та на 7 гривень менше ціни фломастера. Також відомо,
# # що вартість олівця становить 3 гривні. Потрібно визначити загальну вартість покупки.
# # Вхідні дані
# # просимо користувача ввести три змінні
# # кожне з яких не перевищує 109.
# # Вихідні дані
# # виведіть одне ціле число – вартість покупки в гривнях.
# # приклад для перевірки програми 1
# # ввів: 1 1 1
# # отримав: 20

# x = float(input("Скільки Вася купив олівців?"))
# y = float(input("Скільки Вася купив ручок?"))
# z = float(input("Скільки Вася купив фломастерів?"))

# if x > 109:
#     print("Кількість олівців перевищує 109. Введіть менше значення")
#     x = int(input("Введіть к-сть олівці?"))

# if y > 109:
#     print("Кількість ручок перевищує 109. Введіть менше значення")
#     y = int(input("Введіть к-сть олівці?"))

# if z > 109:
#     print("Кількість маркерів перевищує 109. Введіть менше значення")
#     z = int(input("Введіть к-сть олівці?"))

# pencil_price = 3
# pen_price = pencil_price + 2
# marker_price = pen_price + 7

# total_cost = (x * pencil_price) + (y * pen_price) + (z * marker_price)

# print(total_cost)

# _______________________________________________________________________________________________________________

# 12 Циферблад
# Запитайте в користувача скільки хвилин пройшло з початку доби.
# Визначте, скільки годин і хвилин покаже електронний годинник в цей момент і поверніть йому результат (формататування тексту при ввиводі не важливе).
# приклад для перевірки програми 1
# користувач ввів:150
# користувач отримує: 2, 30
# приклад для перевірки програми 2
# користувач ввів:1441
# користувач отримує: 0, 1


# minutes_from_user= int(input("Скільки хвилин пройшло з початку доби?"))

# hours_now = minutes_from_user // 60
# minutes_now = minutes_from_user % 60
# print(hours_now)
# print(minutes_now)

# _______________________________________________________________________________________________________________


13 Журавлики
Петро, Катя та Сергій роблять з паперу журавликів. Разом вони зробили S журавликів.
Скільки журавликів зробила кожна дитина, якщо відомо, що Петро та Сергій зробили однакову кількість журавликів,
а Катя зробила в два рази більше журавликів, ніж Петро та Сергій разом.
Вхідні дані
Юзер вводить загальну кількість журавликів. Отримує три значення скільки зробив кожен (Петро, Катя та Сергій).

