# # задача №1
# # Сформуйте стрінг, в якому міститься інформація про певне слово.
# # "Word [тут слово] has [тут довжина слова, отримайте з самого слова] letters",
# # наприклад "Word 'Python' has 6 letters". Для отримання слова для аналізу скористайтеся константою або функцією input().
#
# word = input("Введіть слово: ")
# word_len = len(word)
# result = f"Word '{word}' has {word_len} letters"
# print(result)

#
# # Задача №2
# # Напишіть калькулятор, який запитує два числа якщо це множення, додавання, ділення, віднімання. Або одне число якщо це
# # зняття коріння або піднесення до степіня. Виводить на екран результат.

# print("№1 - додавання, №2 - ділення, №3 - множення, №4 - віднімання, №5 -  піднесення до степеня, №6 - зняття коріння")
# action_user = int(input("Яку дію хочете зробити?: "))
#
# if action_user == 1:
#     num_1 = int(input("Дай мені число 1: "))
#     num_2 = int(input("Дай мені число 2: "))
#     print(num_1 + num_2)
# elif action_user == 2:
#     num_1 = int(input("Дай мені число 1: "))
#     num_2 = int(input("Дай мені число 2: "))
#     print(num_1 // num_2)
# elif action_user == 3:
#     num_1 = int(input("Дай мені число 1: "))
#     num_2 = int(input("Дай мені число 2: "))
#     print(num_1 * num_2)
# elif action_user == 4:
#     num_1 = int(input("Дай мені число 1: "))
#     num_2 = int(input("Дай мені число 2: "))
#     print(num_1 - num_2)
# elif action_user == 5:
#     num_1 = int(input("Дай мені число: "))
#     num_2 = int(input("Дай мені степінь яку ти хочеш піднести? : "))
#     print(num_1 ** num_2)
# elif action_user == 6:
#     num_1 = int(input("Дай мені число дял зняття коріння: "))
#     print(num_1 ** 0.5)


# Задача №3
# Написати програму, яка просить користувача ввести 4-х значне число з клавіатури, після чого повертає це число навпаки.
# Наприклад, користувач вводить 1234, а програма виводить 4321:
#
# Користувач може ввести будь-яке 4 значне ціле число. Будь-яке 4-х значне число - це число,
# яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
# Ваше рішення має це враховувати! Якщо користувач ввів щось не те повідомте йому.
#
# Варіант 1 Сробуйте вирішити Завдання використовуючи методи поділу (підказка // і %).
#
# Варіант 2 Сробуйте вирішити Завдання використовуючи індекси.
# #
# input_digits = input("Введіть 4-х значне число: ")
# if len(input_digits) > 4 or len(input_digits) < 4:
#     print("Невірне число, допустимі тільки 4-значне число: ")
# if len(input_digits) == 4:
#     print("Дякую, ваше число зафіксовано!")
#     print(input_digits[::-1])

# Задача №4
# Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список. Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.
# Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.
# Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість елементів і в списку непарна кількість елементів.
#
# Задача №5
# Робимо хештег
# Користувач вводить рядок, ви з цього рядка видаляєте все окрім цифр і букв, додаєте на початок хештег і всі слова пишите з великої літери
#
# Приклади
# привіт№; Всім -> #ПривітВсім
# привіт№; Андрій Петрович -> #АндрійПетрович

# string_a = "Првиіт, як справи? як твій день?"
# index_1 = 10
# print(string_a[0])
# print(string_a[4])
# print(string_a[0:4])
# print(string_a[0:index_1])
# print(string_a[:10])
# print(string_a[10:])
# print(string_a[:])
# print(string_a[:1000])
# print(string_a[-5:-1])
# print(string_a[-0:4])
# print(string_a[::2])
# print(string_a[len(string_a )//2 +4:])
# print(string_a[::-1])
